platformio/platform-ststm32/misc/svd/STM32C051.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <baseAddress>0x40003800</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global interrupt</description>
        <value>26</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>Spider_SYSCFG register block</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SYSCFG_CFGR1</name>
          <displayName>SYSCFG_CFGR1</displayName>
          <description>SYSCFG configuration register 1</description>
          <addressOffset>0x00</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <description>Memory mapping selection bits
This bitfield controlled by software selects the memory internally mapped at the address 0x0000 0000. Its reset value is determined by the boot mode configuration. Refer to Section 3: Boot configuration for more details.
x0: Main Flash memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>System Flash memory</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3</name>
                  <description>Embedded SRAM</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PA11_RMP</name>
              <description>PA11 pin remapping
This bit is set and cleared by software. When set, it remaps the PA11 pin to operate as PA9 GPIO port, instead as PA11 GPIO port.
Note: If the PINMUX2[1:0] bitfield of the SYSCFG_CFGR3 register is at 00, PA11_RMP must be kept at 0 to prevent conflict due to two GPIO outputs with different output levels connected to the same pin.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No remap (PA11)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Remap (PA9)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PA12_RMP</name>
              <description>PA12 pin remapping
This bit is set and cleared by software. When set, it remaps the PA12 pin to operate as PA10 GPIO port, instead as PA12 GPIO port.
Note: If the PINMUX4[1:0] bitfield of the SYSCFG_CFGR3 register is at 00, PA12_RMP must be kept at 0 to prevent conflict due to two GPIO outputs with different output levels connected to the same pin.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No remap (PA12)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Remap (PA10)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IR_POL</name>
              <description>IR output polarity selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Output of IRTIM (IR_OUT) is not inverted</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Output of IRTIM (IR_OUT) is inverted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IR_MOD</name>
              <description>IR Modulation Envelope signal selection
This bitfield selects the signal for IR modulation envelope:</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>TIM16</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>USART1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2</name>
                  <description>USART2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C_PB6_FMP</name>
              <description>Fast Mode Plus (FM+) enable for PB6
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on PB6 I/O port.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Disable disabled if not enabled through I2Cx_FMP</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C_PB7_FMP</name>
              <description>Fast Mode Plus (FM+) enable for PB7
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on PB7 I/O port.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Disable disabled if not enabled through I2Cx_FMP</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C_PB8_FMP</name>
              <description>Fast Mode Plus (FM+) enable for PB8
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on PB8 I/O port.
Note: Not available on STM32C011xx.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Disable disabled if not enabled through I2Cx_FMP</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C_PB9_FMP</name>
              <description>Fast Mode Plus (FM+) enable for PB9
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on PB9 I/O port.
Note: Not available on STM32C011xx.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Disable disabled if not enabled through I2Cx_FMP</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C1_FMP</name>
              <description>Fast Mode Plus (FM+) enable for I2C1
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on I/O ports configured as I2C1 through GPIOx_AFR registers.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Disable disabled if not enabled through I2C_y_FMP</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C2_FMP</name>
              <description>Fast Mode Plus (FM+) enable for I2C2
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on I/O ports configured as I2C2 through GPIOx_AFR registers.
Note: Only applicable to STM32C071xx. Reserved on the other products.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Disable disabled if not enabled through I2C_y_FMP</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C_PA9_FMP</name>
              <description>Fast Mode Plus (FM+) enable for PA9
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on PA9 I/O port.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Disable disabled if not enabled through I2Cx_FMP</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C_PA10_FMP</name>
              <description>Fast Mode Plus (FM+) enable for PA10
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on PA10 I/O port.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Disable disabled if not enabled through I2Cx_FMP</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C_PC14_FMP</name>
              <description>Fast Mode Plus (FM+) enable for PC14
This bit is set and cleared by software. It enables I&lt;sup&gt;2&lt;/sup&gt;C FM+ driving capability on PC14 I/O port.
Note: Not available on STM32C011xx.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Disable if not enabled through I2Cx_FMP</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_CFGR2</name>
          <displayName>SYSCFG_CFGR2</displayName>
          <description>SYSCFG configuration register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>LOCKUP_LOCK</name>
              <description>Cortex&lt;Superscript&gt; &lt;Default   Font&gt;-M0+ LOCKUP enable
This bit is set by software and cleared by system reset. When set, it enables the connection of Cortex&lt;Superscript&gt; &lt;Default   Font&gt;-M0+ LOCKUP (HardFault) output to the TIM1/16/17 Break input.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_CFGR3</name>
          <displayName>SYSCFG_CFGR3</displayName>
          <description>SYSCFG configuration register 3</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>PINMUX0</name>
              <description>Pin GPIO multiplexer 0
This bit is set by software and cleared by system reset. It assigns a GPIO to a pin.
1x: Reserved
1x: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_1</name>
                  <description>PB7</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINMUX1</name>
              <description>Pin GPIO multiplexer 1
This bit is set by software and cleared by system reset. It assigns a GPIO to a pin.
1x: Reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_4</name>
                  <description>PF2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_4</name>
                  <description>PA0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_4</name>
                  <description>PA1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_4</name>
                  <description>PA2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINMUX2</name>
              <description>Pin GPIO multiplexer 2
This bit is set by software and cleared by system reset. It assigns a GPIO to a pin.
1x: Reserved
Note: The PA11_RMP bit of the SYSCFG_CFGR1 takes priority over the selection through this bitfield. Refer to the description of the SYSCFG_CFGR1 register for more details.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_5</name>
                  <description>PA8</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_5</name>
                  <description>PA11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINMUX3</name>
              <description>Pin GPIO multiplexer 3
This bit is set by software and cleared by system reset. It assigns a GPIO to a pin.
1x: Reserved</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_8</name>
                  <description>PA14</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_8</name>
                  <description>PB6</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2_STM32C011X___GPIO_ASSIGNED_TO_SO8_PIN_8</name>
                  <description>PC15</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINMUX4</name>
              <description>Pin GPIO multiplexer 4
This bit is set by software and cleared by system reset. It assigns a GPIO to a pin.
1x: Reserved
Note: The PA12_RMP bit of the SYSCFG_CFGR1 takes priority over the selection through this bitfield. Refer to the description of the SYSCFG_CFGR1 register for more details.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0_STM32C011X___GPIO_ASSIGNED_TO_WLCSP12_PIN_E2</name>
                  <description>PA7</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1_STM32C011X___GPIO_ASSIGNED_TO_WLCSP12_PIN_E2</name>
                  <description>PA12</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINMUX5</name>
              <description>Pin GPIO multiplexer 5
This bit is set by software and cleared by system reset. It assigns a GPIO to a pin.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0_STM32C011X___GPIO_ASSIGNED_TO_WLCSP12_PIN_F1</name>
                  <description>PA3</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1_STM32C011X___GPIO_ASSIGNED_TO_WLCSP12_PIN_F1</name>
                  <description>PA4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x2_STM32C011X___GPIO_ASSIGNED_TO_WLCSP12_PIN_F1</name>
                  <description>PA5</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x3_STM32C011X___GPIO_ASSIGNED_TO_WLCSP12_PIN_F1</name>
                  <description>PA6</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE0</name>
          <displayName>SYSCFG_ITLINE0</displayName>
          <description>SYSCFG interrupt line 0 status register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>WWDG</name>
              <description>Window watchdog interrupt pending flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
