platformio/platform-ststm32/misc/svd/STM32C051.svd
        <register>
          <name>SYSCFG_ITLINE1</name>
          <displayName>SYSCFG_ITLINE1</displayName>
          <description>SYSCFG interrupt line 1 status register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>PVM_VDDIO2_OUT</name>
              <description>V&lt;sub&gt;DDIO2&lt;/sub&gt; supply monitoring interrupt request pending (EXTI line 34)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE2</name>
          <displayName>SYSCFG_ITLINE2</displayName>
          <description>SYSCFG interrupt line 2 status register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RTC</name>
              <description>RTC interrupt request pending (EXTI line 19)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE3</name>
          <displayName>SYSCFG_ITLINE3</displayName>
          <description>SYSCFG interrupt line 3 status register</description>
          <addressOffset>0x8C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>FLASH_ITF</name>
              <description>Flash interface interrupt request pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE4</name>
          <displayName>SYSCFG_ITLINE4</displayName>
          <description>SYSCFG interrupt line 4 status register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>RCC</name>
              <description>Reset and clock control interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRS</name>
              <description>CRS interrupt request pending
Note: Only applicable on STM32C071xx, reserved on other products.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE5</name>
          <displayName>SYSCFG_ITLINE5</displayName>
          <description>SYSCFG interrupt line 5 status register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>EXTI0</name>
              <description>EXTI line 0 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI1</name>
              <description>EXTI line 1 interrupt request pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE6</name>
          <displayName>SYSCFG_ITLINE6</displayName>
          <description>SYSCFG interrupt line 6 status register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>EXTI2</name>
              <description>EXTI line 2 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI3</name>
              <description>EXTI line 3 interrupt request pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE7</name>
          <displayName>SYSCFG_ITLINE7</displayName>
          <description>SYSCFG interrupt line 7 status register</description>
          <addressOffset>0x9C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>EXTI4</name>
              <description>EXTI line 4 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI5</name>
              <description>EXTI line 5 interrupt request pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI6</name>
              <description>EXTI line 6 interrupt request pending</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI7</name>
              <description>EXTI line 7 interrupt request pending</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI8</name>
              <description>EXTI line 8 interrupt request pending</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI9</name>
              <description>EXTI line 9 interrupt request pending</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI10</name>
              <description>EXTI line 10 interrupt request pending</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI11</name>
              <description>EXTI line 11 interrupt request pending</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI12</name>
              <description>EXTI line 12 interrupt request pending</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI13</name>
              <description>EXTI line 13 interrupt request pending</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI14</name>
              <description>EXTI line 14 interrupt request pending</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXTI15</name>
              <description>EXTI line 15 interrupt request pending</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE8</name>
          <displayName>SYSCFG_ITLINE8</displayName>
          <description>SYSCFG interrupt line 8 status register</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>USB</name>
              <description>USB interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE9</name>
          <displayName>SYSCFG_ITLINE9</displayName>
          <description>SYSCFG interrupt line 9 status register</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DMA1_CH1</name>
              <description>DMA1 channel 1interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE10</name>
          <displayName>SYSCFG_ITLINE10</displayName>
          <description>SYSCFG interrupt line 10 status register</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DMA1_CH2</name>
              <description>DMA1 channel 2 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA1_CH3</name>
              <description>DMA1 channel 3 interrupt request pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE11</name>
          <displayName>SYSCFG_ITLINE11</displayName>
          <description>SYSCFG interrupt line 11 status register</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DMAMUX</name>
              <description>DMAMUX interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_CH4</name>
              <description>DMA channel 5 interrupt request pending
Note: Only applicable on STM32C071xx, reserved on the other products.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMA_CH5</name>
              <description>DMA channel 5 interrupt request pending
Note: Only applicable on STM32C071xx, reserved on the other products.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE12</name>
          <displayName>SYSCFG_ITLINE12</displayName>
          <description>SYSCFG interrupt line 12 status register</description>
          <addressOffset>0xB0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADC</name>
              <description>ADC interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE13</name>
          <displayName>SYSCFG_ITLINE13</displayName>
          <description>SYSCFG interrupt line 13 status register</description>
          <addressOffset>0xB4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>TIM1_CCU</name>
              <description>Timer 1 commutation interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM1_TRG</name>
              <description>Timer 1 trigger interrupt request pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM1_UPD</name>
              <description>Timer 1 update interrupt request pending</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM1_BRK</name>
              <description>Timer 1 break interrupt request pending</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE14</name>
          <displayName>SYSCFG_ITLINE14</displayName>
          <description>SYSCFG interrupt line 14 status register</description>
          <addressOffset>0xB8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>TIM1_CC</name>
              <description>Timer 1 capture compare interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE15</name>
          <displayName>SYSCFG_ITLINE15</displayName>
          <description>SYSCFG interrupt line 15 status register</description>
          <addressOffset>0xBC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>TIM2</name>
              <description>TIM2 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE16</name>
          <displayName>SYSCFG_ITLINE16</displayName>
          <description>SYSCFG interrupt line 16 status register</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>TIM3</name>
              <description>Timer 3 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE19</name>
          <displayName>SYSCFG_ITLINE19</displayName>
          <description>SYSCFG interrupt line 19 status register</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>TIM14</name>
              <description>Timer 14 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE21</name>
          <displayName>SYSCFG_ITLINE21</displayName>
          <description>SYSCFG interrupt line 21 status register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>TIM16</name>
              <description>Timer 16 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE22</name>
          <displayName>SYSCFG_ITLINE22</displayName>
          <description>SYSCFG interrupt line 22 status register</description>
          <addressOffset>0xD8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>TIM17</name>
              <description>Timer 17 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE23</name>
          <displayName>SYSCFG_ITLINE23</displayName>
          <description>SYSCFG interrupt line 23 status register</description>
          <addressOffset>0xDC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>I2C1</name>
              <description>I2C1 interrupt request pending, combined with EXTI line 23</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE24</name>
          <displayName>SYSCFG_ITLINE24</displayName>
          <description>SYSCFG interrupt line 24 status register</description>
          <addressOffset>0xE0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>I2C2</name>
              <description>I2C2 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE25</name>
          <displayName>SYSCFG_ITLINE25</displayName>
          <description>SYSCFG interrupt line 25 status register</description>
          <addressOffset>0xE4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SPI1</name>
              <description>SPI1 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE26</name>
          <displayName>SYSCFG_ITLINE26</displayName>
          <description>SYSCFG interrupt line 26 status register</description>
          <addressOffset>0xE8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SPI2</name>
              <description>SPI2 interrupt request pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE27</name>
          <displayName>SYSCFG_ITLINE27</displayName>
          <description>SYSCFG interrupt line 27 status register</description>
          <addressOffset>0xEC</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>USART1</name>
              <description>USART1 interrupt request pending, combined with EXTI line 25</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG_ITLINE28</name>
          <displayName>SYSCFG_ITLINE28</displayName>
          <description>SYSCFG interrupt line 28 status register</description>
          <addressOffset>0xF0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>USART2</name>
              <description>USART2 interrupt request pending (EXTI line 26)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
